OMNIVUeTests/serviceTestData/NPEdeviceCreation.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <icl:CreateDeviceRequest xmlns:icl="http://www.ICLNBI.com/ICLNBI_V2.00.xsd">
         <MessageElements>
            <MessageAddressing>
               <from>DSP</from>
               <to>ICL</to>
               <replyTo>DSP</replyTo>
               <messageID>DSP1382007145205</messageID>
               <action>CreateDevice</action>
               <timestamp>Thu Oct 17 16:22:25 IST 2013</timestamp>
               <transactionID>1382007145205</transactionID>
               <serviceName>CreateDevice</serviceName>
               <serviceVersion>3.0</serviceVersion>
               <userId>DSPWFPP</userId>
               <password>DSPWFPP</password>
            </MessageAddressing>
         </MessageElements>
         <Device>
            <commonName>ETRPNVFH722-1234</commonName>
            <sourceSystem>ARM</sourceSystem>
            <CLLICode>LSVGNVZXCLT</CLLICode>
            <ResourceSubType>Actelis ML130</ResourceSubType>
            <ResourceDescribedBy>
               <CharacteristicName>isSharedOrDedicated</CharacteristicName>
               <CharacteristicValue>SHARED</CharacteristicValue>
            </ResourceDescribedBy>
            <ResourceDescribedBy>
               <CharacteristicName>PortDirection</CharacteristicName>
               <CharacteristicValue>CF</CharacteristicValue>
            </ResourceDescribedBy>
            <ResourceDescribedBy>
               <CharacteristicName>MetaDataRequired</CharacteristicName>
               <CharacteristicValue>True</CharacteristicValue>
            </ResourceDescribedBy>
            <OwnsResourceDetails>
               <Customer>
                  <commonName>A001101</commonName>
               </Customer>
            </OwnsResourceDetails>
            <prStatus>Planned</prStatus>
         
            <HasPhysicalDeviceRoles>
               <commonName>NPE</commonName>
            </HasPhysicalDeviceRoles>
           
            <ConsistsOfRack>
               <commonName>01WLSO.01</commonName>
            </ConsistsOfRack>
            <InstalledAtAddress>
               <commonName>B20796</commonName>
            </InstalledAtAddress>
         </Device>
      </icl:CreateDeviceRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>